
## :white_check_mark: Apply Succeeded (transactional-emails-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/78619)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.archive_file.events_sqs-event-consumer_lambda_lambda-default-file_DF5A641D: Reading...
data.archive_file.events_sqs-event-consumer_lambda_lambda-default-file_DF5A641D: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
aws_sqs_queue.sns-topic-dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-SNS-Topics-DLQ]
data.aws_iam_policy_document.events_sqs-event-consumer_lambda_assume-policy-document_BCF09A05: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.caller: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:TransactionalEmails-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_iam_policy_document.events_sqs-event-consumer_lambda_assume-policy-document_BCF09A05: Read complete after 0s [id=1349007126]
data.aws_ssm_parameter.events_sentry-dsn_01E48A0C: Reading...
data.aws_region.region: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_region.region: Read complete after 0s [id=us-east-1]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:TransactionalEmails-Prod-Infrastructure-Alarm-Critical]
aws_codedeploy_app.events_sqs-event-consumer_lambda-code-deploy_code-deploy-app_7EC26991: Refreshing state... [id=aa972051-f1ba-4d04-ae8a-b585123cb1a4:TransactionalEmails-Prod-Sqs-Event-Consumer-Lambda]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
aws_sqs_queue.events_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_E7883864: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-Sqs-Event-Consumer-Queue-Deadletter]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_s3_bucket.events_sqs-event-consumer_lambda_code-bucket_BDF9A5D8: Refreshing state... [id=pocket-transactionalemails-prod-sqs-event-consumer]
data.aws_ssm_parameter.events_sentry-dsn_01E48A0C: Read complete after 1s [id=/TransactionalEmails/Prod/SENTRY_DSN]
data.aws_iam_policy_document.events_sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_7D86C0C0: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 1s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.events_service-hash_8328564D: Reading...
aws_iam_role.events_sqs-event-consumer_lambda_execution-role_F06C65D9: Refreshing state... [id=TransactionalEmails-Prod-Sqs-Event-Consumer-ExecutionRole]
data.aws_iam_policy_document.events_sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_7D86C0C0: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.events_sqs-event-consumer_lambda_execution-policy-document_CCCC8686: Reading...
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.aws_iam_policy_document.transactional-email-sns-dlq-policy-document: Reading...
data.aws_iam_policy_document.events_sqs-event-consumer_lambda_execution-policy-document_CCCC8686: Read complete after 0s [id=1830872551]
data.aws_iam_policy_document.transactional-email-sns-dlq-policy-document: Read complete after 0s [id=3545117414]
aws_iam_policy.events_sqs-event-consumer_lambda_execution-policy_1AD3460D: Refreshing state... [id=arn:aws:iam::996905175585:policy/TransactionalEmails-Prod-Sqs-Event-Consumer-ExecutionRolePolicy]
aws_iam_role.events_sqs-event-consumer_lambda-code-deploy_code-deploy-role_4FCF08D9: Refreshing state... [id=TransactionalEmails-Prod-Sqs-Event-Consumer-CodeDeployRole]
aws_sqs_queue.events_sqs-event-consumer_lambda_sqs_queue_374A86EB: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-Sqs-Event-Consumer-Queue]
data.aws_ssm_parameter.events_service-hash_8328564D: Read complete after 0s [id=/TransactionalEmails/CircleCI/Prod/SERVICE_HASH]
aws_sqs_queue_policy.transactional-email-sns-dlq-policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-SNS-Topics-DLQ]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.terraform_remote_state.incident_management: Read complete after 1s
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PT78UD9]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PPXKU0J]
aws_sns_topic_subscription.PremiumPurchase-Topic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic:1d3fa66d-5971-45b2-b9f1-dd5a030e292e]
aws_sns_topic_subscription.UserEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:354cdd64-8e94-453d-8f6e-b46d2540f7e7]
aws_sns_topic_subscription.UserRegistrationTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic:157e1ede-de97-4e2f-93aa-e1bc7f97806d]
data.aws_iam_policy_document.transactional-email-sns-sqs-policy-document: Reading...
data.aws_iam_policy_document.transactional-email-sns-sqs-policy-document: Read complete after 0s [id=923285332]
data.aws_iam_policy_document.events_sqs-event-consumer_lambda_sqs_policy_5106A819: Reading...
aws_iam_role_policy_attachment.events_sqs-event-consumer_lambda-code-deploy_code-deploy-policy-attachment_82779A66: Refreshing state... [id=TransactionalEmails-Prod-Sqs-Event-Consumer-CodeDeployRole-20220621212049301400000002]
data.aws_iam_policy_document.events_sqs-event-consumer_lambda_sqs_policy_5106A819: Read complete after 0s [id=2706817332]
aws_iam_role_policy_attachment.events_sqs-event-consumer_lambda_execution-role-policy-attachment_23784834: Refreshing state... [id=TransactionalEmails-Prod-Sqs-Event-Consumer-ExecutionRole-20220621212049268800000001]
aws_s3_bucket_ownership_controls.events_sqs-event-consumer_lambda_code-bucket-ownership-controls_EB225FF5: Refreshing state... [id=pocket-transactionalemails-prod-sqs-event-consumer]
aws_sqs_queue_policy.transactional-email-sns-sqs-policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-Sqs-Event-Consumer-Queue]
aws_codedeploy_deployment_group.events_sqs-event-consumer_lambda-code-deploy_code-deployment-group_BF92F57F: Refreshing state... [id=977bbab8-79dc-406c-8dc2-8ef9fffa78b9]
aws_iam_policy.events_sqs-event-consumer_sqs-policy_137E47FC: Refreshing state... [id=arn:aws:iam::996905175585:policy/TransactionalEmails-Prod-Sqs-Event-Consumer-LambdaSQSPolicy]
aws_s3_bucket_public_access_block.events_sqs-event-consumer_lambda_code-bucket-public-access-block_B193BBE0: Refreshing state... [id=pocket-transactionalemails-prod-sqs-event-consumer]
aws_s3_bucket_acl.events_sqs-event-consumer_lambda_code-bucket-acl_F4DBF6D5: Refreshing state... [id=pocket-transactionalemails-prod-sqs-event-consumer,private]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-867638e3]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
aws_iam_role_policy_attachment.events_sqs-event-consumer_execution-role-policy-attachment_6987CDBE: Refreshing state... [id=TransactionalEmails-Prod-Sqs-Event-Consumer-ExecutionRole-20220621212139396200000003]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 0s [id=PZQ6AUS]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
aws_lambda_function.events_sqs-event-consumer_lambda_3BE960B8: Refreshing state... [id=TransactionalEmails-Prod-Sqs-Event-Consumer-Function]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=PS0PX19]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=P7EDVZW]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=POR1WOJ]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PVZAXDZ]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:TransactionalEmails-Prod-Infrastructure-Alarm-Non-Critical:7714523e-597e-49a6-9740-15eae511e26a]
aws_cloudwatch_log_group.events_sqs-event-consumer_lambda_log-group_BD35528B: Refreshing state... [id=/aws/lambda/TransactionalEmails-Prod-Sqs-Event-Consumer-Function]
aws_lambda_alias.events_sqs-event-consumer_lambda_alias_0C07F112: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:TransactionalEmails-Prod-Sqs-Event-Consumer-Function:DEPLOYED]
aws_lambda_event_source_mapping.events_sqs-event-consumer_lambda_event_source_mapping_6A1F717A: Refreshing state... [id=ad34361c-55f3-4404-af42-d68b62af3d4c]
aws_cloudwatch_metric_alarm.events_sqs-event-consumer_errors_D9533157: Refreshing state... [id=TransactionalEmails-Prod-Sqs-Event-Consumer-Lambda-Errors-Alarm]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:TransactionalEmails-Prod-Infrastructure-Alarm-Critical:44e80f3d-0f50-425b-8902-5b51bf423325]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sns_topic_subscription.ForgotPasswordRequest-Topic-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "ForgotPasswordRequest-Topic-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_sns_topic_subscription.ForgotPasswordRequest-Topic-sns-subscription: Creating...
aws_sns_topic_subscription.ForgotPasswordRequest-Topic-sns-subscription: Creation complete after 1s [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic:1d1843f4-f405-4384-823a-ad21801a0af1]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"7384bf02-c6c4-4cb7-86fe-4ebf88317f49","JobName":"transactional-emails_infrastructure_apply_prod","PRNumber":249,"Program":"tfcmt","SHA1":"dcf881f9d6d25e5ed18fdba48c68cb011e0751f6","Target":"transactional-emails-cdk","Vars":{}} -->